erp3l/src/Catalogs/СоответствияСчетовМеждународногоУчета/СоответствияСчетовМеждународногоУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СоответствияСчетовМеждународногоУчета</name>
  <attributes>
    <name>СчетРеглУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетМеждународногоУчета</name>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйОтбор</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеОтбора</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УстановленДополнительныйОтбор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланСчетов</name>
    <type>
      <types>CatalogRef.ПланыСчетовМеждународногоУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПереходНаНовыеФормулыВыполнен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЕстьОшибкиПереходаНаНовыйФорматФормул</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиЗаполненияСубконто</name>
    <attributes>
      <name>ВидСубконто</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыСубконтоМеждународные</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаполнятьИзИсточника</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УказанноеЗначение</name>
      <type>
        <types>Characteristic.ВидыСубконтоМеждународные</types>
      </type>
    </attributes>
    <attributes>
      <name>Выражение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыражениеИсторияПереходаНаНовыеФормулы</name>
      <comment>Значение формулы до перехода на новый формат либо первое значение формулы введенное после перехода</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/Catalogs/СоответствияСчетовМеждународногоУчета/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	НепроверяемыеРеквизиты.Добавить("НастройкиЗаполненияСубконто.Выражение");
	НепроверяемыеРеквизиты.Добавить("Наименование");
	
	ПроверитьНастройкиЗаполненияСубконто(Отказ);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если УстановленДополнительныйОтбор Тогда
		Наименование = "%СчетРеглУчета, %ПредставлениеОтбора - %СчетМеждународногоУчета";
	Иначе
		Наименование = "%СчетРеглУчета - %СчетМеждународногоУчета";
	КонецЕсли;
	Наименование = СтрЗаменить(Наименование, "%СчетРеглУчета", СчетРеглУчета);
	Наименование = СтрЗаменить(Наименование, "%СчетМеждународногоУчета", СчетМеждународногоУчета);
	
	Если СтрДлина(ПредставлениеОтбора) > 40 Тогда
		ОтбораДляНаименования = Лев(ПредставлениеОтбора, 40) + "...";
	Иначе
		ОтбораДляНаименования = ПредставлениеОтбора;
	КонецЕсли;
	Наименование = СтрЗаменить(Наименование, "%ПредставлениеОтбора", ОтбораДляНаименования);
	
	УстановкаРеквизитовИсторииПереходаНаНовыеФормулы();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановкаРеквизитовИсторииПереходаНаНовыеФормулы()
	
	Для Каждого СтрокаТЧ Из НастройкиЗаполненияСубконто Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ВыражениеИсторияПереходаНаНовыеФормулы)
			И ЗначениеЗаполнено(СтрокаТЧ.Выражение) Тогда
			СтрокаТЧ.ВыражениеИсторияПереходаНаНовыеФормулы = СтрокаТЧ.Выражение;
		КонецЕсли;
	КонецЦикла;
	УдалитьПереходНаНовыеФормулыВыполнен = Истина;
	
КонецПроцедуры

Процедура ПроверитьНастройкиЗаполненияСубконто(Отказ)
	
	ШаблонСообщения = НСтр("ru = 'Не настроено заполнение для субконто ""%1""';
							|en = 'Population of the ""%1"" extra dimension is not set up'");
	Для каждого Строка Из НастройкиЗаполненияСубконто Цикл
		
		НеНастроеноЗаполнениеСубконто = Ложь;
		Если Не ЗначениеЗаполнено(Строка.Выражение) И Строка.ЗаполнятьИзИсточника Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, Строка.ВидСубконто);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
